<template>
    <div>
        <heading :name="'流量细则'"></heading>
        <div class="usage-rules-module">

            <div class="box">
                <h3>爱享流量使用细则</h3>
                <p >1.  活动时间：</p>
                <p class="text-indent-2">2017年8月1日起。</p>
                <p >2.  活动对象：</p>
                <p class="text-indent-2">所有工银信用卡持卡人（下称“持卡人”）。</p>
                <p >3.  活动入口：</p>
                <p class="text-indent-2" >①  微信公众号：工银信用卡微讯。</p>
                <p class="text-indent-2" >②  APP移动客户端：持卡人下载并注册工商银行的工银e生活APP。</p>
                <p>4.  持卡人可通过参与工商银行活动获得不同的爱享流量值或基于流量平台自行为流量账户购买的爱享流量值，爱享流量值既可用于提取手机流量包（以下称“流量包” ），也可用于兑换平台提供的具体礼品。</p>
                <p>5.  持卡人所获得的流量值均包含提取有效期在内的相关使用限制，有效期的规定及其他限制规定详见各个活动的细则规定。</p>
                <p>6.  爱享流量可提取的流量包限中国移动、中国电信、中国联通用户（不含虚拟运营商）使用，流量可全国漫游（不含港澳台），支持2G/3G/4G网络。</p>
                <p>7.  持卡人基于爱享流量平台进行流量包的提取。在持卡人完成流量包提取之后，流量包所含流量将于2个工作日内充入持卡人输入的手机号码中。</p>
                <p>8.  所提取流量包当月有效，如持卡人在本省定制了灵活账期，流量包有效期以持卡人的账期为准，详询当地运营商。</p>
                <p>9.  流量包的使用优先级别以当地运营商规则为准。</p>
                <p>10.  因受运营商业务制约，每月初第一天和月末48小时内流量包的充值不稳定，相关服务可能暂停，具体依照各地运营商情况而定。</p>
                <p>11.  若持卡人尚未开通移动数据流量功能，提取成功后，需要持卡人自行开通数据流量才能使用。</p>
                <p>12.  活动产品为虚拟充值产品，流量包一旦提取成功（指客户流量包提取），无法更改号码，也无法办理退款。用户进行账户充值、流量提取，均无法办理退货。</p>
                <p>13.  如持卡人选择充值的手机号码为异常状态，如：停机、欠费、黑名单、退网（销户）、未实名（身份资料不全，身份证非18位等）、号码异常、携号转网等用户，将不可进行流量包提取。</p>
                <p>14.  因受业务制约，包括但不限于以下类型用户，不可使用流量“银行”进行流量包提取：1）联通:无线上网卡、主副卡的副卡、4G副卡、上网卡、如意通卡、久聊卡用户；2）联通: 未修改初始密码、捆绑宽带业务、当月办理套餐变更、改号、转换品牌（携号转网）、转4G业务；3）联通:同时开通省内通话、国内通话、国际漫游通话及三方通话业务，需致电10010取消掉其中一项业务后再进行充值；4）联通：3G5元/20元预付费套餐、智慧沃家套餐、集团大客户套餐、沃邮箱免费版业务。5）联通黑龙江、青海2G用户；6）联通流量封顶用户，流量包订购次数已达上限的用户；7）电信天翼无线宽带套餐、时长计费用户；8）广东移动“随心王”套餐用户。</p>
                <p>15.  如持卡人因以上13、14条情况导致流量包提取失败，我行将于5个工作日内将扣除的流量值或支付的金额（或积分）退还给持卡人。</p>
                <p>16.  如持卡人非以上13、14条情况导致流量包提取失败，我行将于5个工作日内将流量包充入账户。</p>
                <p>17.  本产品无法提供发票，敬请谅解。</p>
                <p>18.  活动相关问题可咨询中国工商银行客户服务热线95588。</p>
                <p>19.  工商银行不负责一切有关商品或服务事宜，相关流量平台的服务商品均由北京若为信息技术有限公司负责，商户服务热线4008796969，工作时间9:00-18:00（周一— 周五）。</p>

                <h3>爱享流量提取页面细则</h3>
                <p>1.  流量包的提取规格为100M、500M、1G三种，以流量余额为基础，优先提取500M、1G的大额流量包，100M流量包仅限流量余额低于500M时使用。具体提取方式以活动页面提示为准。</p>
                <p>2.  因受运营商业务制约，月初第一天和月末最后一天不能提取，月末48小时内充值不稳定，请尽量避开该段时间办理业务。</p>
                <p>3.  爱享流量值为作为虚拟充值产品，流量包一旦提取成功（指客户流量包提取），无法更改号码，也无法办理退款。用户进行账户充值、流量提取，均无法办理退货。</p>
                <p>4.  如持卡人选择充值的手机号码为异常状态，如：停机、欠费、黑名单、退网（销户）、未实名（身份资料不全，身份证非18位等）、号码异常、携号转网等用户，将不可进行流量包提取。</p>
                <p>5.  流量成功提取并充值到手机后，根据运营商提供的流量标准，仅当月有效不能结转。</p>
                <p>6.  流量有效期展现形式：本月作废流量值    下月作废流量值。</p>
                <h3>爱享流量账户充值细则</h3>
                <p>1.  持卡人可基于流量平台进行爱享流量值的账户充值后，系统自动更新流量账户余额，如因网络等特殊原因造成流量值获得失败，我行将于5个工作日内将支付的金额（或积分）退还给持卡人。</p>
                <p>2.  持卡人自行账户充值的爱享流量值的有效期为12个月。</p>
                <p>3.  持卡人如有下述任何一种情况，其获赠爱享流量值的资格将被取消，包含但不限于：进行虚假交易或者违法交易、当前账户出现欠款逾期、账户状态不正常、出现所持信用卡过期、被停用、管制、持卡人自行注销信用卡、对所欠工银信用卡债务不偿还、违反《中国工商银行信用卡(个人卡)章程》及相关领用合约、以个人名义将爱享流量值以任意形式在公开市场中销售或违反本活动及其他相关规定的。</p>
                <p>4.  本活动及其未尽事宜，仍同时受《中国工商银行信用卡（个人卡）章程》及相关领用合约等文件约束。</p>
                <p>5.  在法律法规许可的范围内，工商银行牡丹卡中心保留变更、调整、终止本活动之权利并于相关渠道公告后生效。</p>
                <p>6.  如参与活动的客户存在任何利用虚假交易、系统漏洞等手段恶意套取优惠的行为的，工商银行牡丹卡中心保留取消该类客户流量值领取与使用的权利。</p>
                <p>7.  本次活动规则如有调整，以中国工商银行官方网站公告及页面提示为准。</p>
                <h3>流量兑换码使用细则</h3>
                <p>1.  持卡人输入兑换码后，可兑换对应金额的爱享流量值，自动存入流量账户。</p>
                <p>2.  流量值的使用遵守《爱享流量使用细则》的相关规定。</p>
                <h3>爱享流量红包使用细则</h3>
                <p>1.  持卡人可在爱享流量账户可用流量余额范围内进行流量红包分享，持卡人发出爱享流量红包时，红包个数最多可设定100个，流量红包的总流量值最低低为10M，最高5000M。</p>
                <p>2.  红包分为两种形式：普通红包、拼手气红包。发出红包时，普通红包为每个红包均含有指定流量值，总流量值按红包个数乘以单个红包流量值计算。拼手气红包为直接设定总流量值，单个红包的流量值随机分配。</p>
                <p>3.  领取流量红包时，用户需输入手机号方可领取成功，获取流量值。</p>
                <p>4.  持卡人一旦完成发流量红包的操作，无法撤销或更改。</p>
                <p>5.  持卡人一旦完成发流量红包的操作，红包的领取有效期为24小时。如在24小时内，该红包未进行分享或未被领完，剩余流量值将退回至发红包者流量账户内。</p>
                <p>6.  持卡人一旦完成发流量红包操作，系统将直接扣减发流量红包者流量账户余额。</p>
                <p>7.  未领完的红包，可在“已发出红包”内对指定红包进行二次发送。</p>
                <p>8.  持卡人一旦完成发流量红包操作，该流量红包内的流量值提取有效期将更新为该流量红包内各笔流量值 （含各市场活动所获流量值）中最先截止的有效期 。收流量红包领取的流量值和退回至发流量红包者流量账户内的流量值，其有效期均以更新后的有效期为准。</p>
                <p>9.  领取的流量值将计入收流量红包用户的流量账户内，收流量红包操作可通过工银e生活APP、工银信用卡微讯完成，提取或使用流量时，需客户下载并进入工银e生活APP，注册完成后，进入爱享流量平台。</p>
                <p>10.  领取的流量值的使用遵守《爱享流量使用细则》。</p>
                <h3>流量直充业务细则</h3>
                <p>1.  平台提供的直充流量均为全国漫游流量，支持全国移动、全国联通、全国电信的手机流量充值。平台自动根据持卡人的注册手机号，展现对应运营商的流量规格包（以下简称流量包）。</p>
                <p>2.  根据运营商通道情况不同，一般在30分钟以内完成直充。</p>
                <p>3.  充值成功后，交易无法取消，已充值流量无法退货或转存其他电话号码。</p>

                <!--<router-link :to="{ name: 'buyflowtest',query:{score:score}}" class="detailed-list">
                      <div style="display:inline-block;width:2rem;height:2rem;position:absolute;left:0;margin-top:.5rem;background:rgba(0,0,0,0)"></div>
                    </router-link>
                <router-link :to="{ name: 'credit'}" class="detailed-list">
                  <div style="display:inline-block;width:2rem;height:2rem;position:absolute;right:0;margin-top:.5rem;background:rgba(0,0,0,0)"></div>
                </router-link>-->
                <!--<div class="detailed-list" @click="test1">
                    <div style="display:inline-block;width:2rem;height:2rem;position:absolute;left:0;margin-top:.5rem;background:rgba(0,0,0,0)"></div>
                </div>
                <div class="detailed-list" @click="test2">
                    <div style="display:inline-block;width:2rem;height:2rem;position:absolute;right:0;margin-top:.5rem;background:rgba(0,0,0,0)"></div>
                </div>-->
            </div>

        </div>
    </div>

</template>
<style lang="scss" scoped>
    @import '../assets/css/common';

    .usage-rules-module {
        position: relative!important;
        /*height: 115.58rem !important;*/
        padding:0.2rem 0;
        background: #fff;
        .box{
            /*height:115.58rem;*/
            min-height: 20rem;
            border:0.03rem solid #e32e45;
            border-radius: 0.1rem;
            width: 6.3rem;
            margin:0 auto;
            padding:0 0.3rem 0;
            position: relative;
            h3{
                width:5.54rem;
                height:0.76rem;
                background: url("../assets/images/bg-red-title.png") no-repeat;
                background-size: 100% 100%;
                color: #fff;
                text-align: center;
                line-height:0.76rem;font-size: 0.4rem;
                margin:0.34rem auto 0;
            }
            p{
                text-indent: 0.3rem;
                color: #333;
                font-size: 0.24rem;
                padding-top: 0.38rem;
                line-height: 0.64rem;
            }
            .text-indent-2{
                text-indent: 0.9rem;
                padding-top: 0;
            }
            .text-indent-4{}
        }

    }
</style>

<script>
    import heading from '../components/heading.vue'
    export default {
        components: {
            heading
        },
        mounted () {

        },
        data () {
            return {
                score:0
            }
        },
        methods: {
/*            test1 () {
//                window.location.href = 'https://gprstst.ruwe.cn/icbc_world_cup/#/signin'
                this.$router.push({name : 'signin'})
            },
            test2 () {
//                window.location.href = 'https://gprstst.ruwe.cn/icbc_world_cup/#/index'
                this.$router.push({name : 'worldcupindex'})
            }*/
        }
    }
</script>

